#include <iostream>
#include <Windows.h>
#include <string>
#include <locale>
#include <time.h>
#include <cstdlib>
#include <vector>


#define слышь std::cout
#define харчок std::endl
#define понял if
#define типа else
#define кароче int
#define стопэ break
#define хопа rand
#define сука while 
#define зуб_даю true
#define бухаем_блять void
#define гони return
#define пошли_бухать srand(time(0))
#define по_русски_базарь setlocale(LC_ALL, "ru")
#define ну_че_народ_погнали_нахуй main()
#define погнал <<
#define хоп ;
#define в_зону {
#define отсидел }
#define трахнул +
#define ебанул ,
#define тёлку std::to_string
#define чаво std::string
#define чмо (
#define лох )
#define члена GetStdHandle(STD_OUTPUT_HANDLE)
#define дрочка SetConsoleCursorPosition
#define пиздец ++
#define маленький short
#define гей = 
#define трансфестит ==
#define залупа &&
#define петух %
#define херню ";"
#define у_меня_встал COORD
#define блять for
#define проще >=
#define сложно <=
#define гобела "гобела"
#define дрыхнуть Sleep
#define нахуй do
#define дрочит_и_потом "\x1b[38;2;"
#define жопа_ты_и_я ";2m"

#define пизда +
#define хуесос *
#define ты_никто 0
#define гондон 1
#define за_наркоту_сидит 228
#define малолетка 12
#define один_два_три_четрые 1234
#define хлебальник std::cin
#define говорит >>
#define дохера std::vector
#define много >
#define мало <

#define Соси_хуй_блять "Соси хуй блять "
#define Пизда_ещё "Пизда "
#define Слышь_ещё "слышь "




бухаем_блять нюхай_бебру чмо лох
в_зону

    слышь погнал "Напиши цифры заполнения блять" хоп
    дохера мало кароче много чуркан хоп
    блять чмо кароче ебобо гей ты_никто хоп ебобо сложно малолетка хоп ебобо пиздец лох
    в_зону
        кароче ебааать хоп
        кароче ебать_меня гей -гондон хоп
        хлебальник говорит ебааать хоп
        чуркан.push_back(ебааать) хоп
        кароче чурка гей ты_никто хоп
        сука чмо чурка сложно size(чуркан) лох
        в_зону
            
            понял чмо чуркан[чурка] сложно ебать_меня лох
            в_зону
                ебааать гей ебать_меня хоп
            отсидел

            типа 
            в_зону
                ебааать гей чуркан[чурка] хоп
            отсидел
            
            чурка пиздец хоп
            


        отсидел


        слышь погнал "Максимум :" погнал чурка хоп
    отсидел



отсидел



бухаем_блять пошли_колотся чмо кароче хуй ебанул кароче член лох
в_зону
    дрочка чмо члена ебанул у_меня_встал в_зону чмо маленький лох хуй ебанул чмо маленький лох член отсидел лох хоп
отсидел


бухаем_блять пизда_тебе чмо кароче шлю лох
в_зону

кароче хуйня гей ты_никто хоп

    понял чмо шлю трансфестит малолетка лох
    в_зону
        блять чмо кароче мелкий гей ты_никто хоп мелкий сложно шлю хоп мелкий пиздец лох
            в_зону
                слышь погнал Соси_хуй_блять хоп
                дрыхнуть чмо чмо гондон пизда малолетка лох хуесос чмо гондон пизда малолетка лох хуесос гондон лох хоп
            отсидел
    отсидел
    типа 
    в_зону
        нахуй в_зону

            слышь погнал Пизда_ещё хоп
            дрыхнуть чмо малолетка хуесос малолетка лох хоп
            хуйня пиздец хоп
        отсидел сука чмо хуйня сложно шлю лох хоп
    отсидел
отсидел

чаво цвет_дай чмо кароче красный ебанул кароче зелёный ебанул кароче голубой лох
в_зону
    чаво базар гей дрочит_и_потом трахнул тёлку чмо красный лох трахнул херню трахнул тёлку чмо зелёный лох трахнул херню трахнул тёлку чмо голубой лох трахнул жопа_ты_и_я хоп
    гони базар хоп
отсидел

кароче ну_че_народ_погнали_нахуй
в_зону
   
    пошли_бухать хоп
    по_русски_базарь хоп
    //нюхай_бебру чмо лох хоп
    пизда_тебе чмо гондон хуесос малолетка лох хоп
    кароче красный ебанул зелёный ебанул голубой хоп
    кароче это_ты гей ты_никто хоп
    сука чмо зуб_даю лох
    в_зону
        слышь погнал цвет_дай чмо красный гей хопа чмо лох петух за_наркоту_сидит ебанул зелёный гей хопа чмо лох петух за_наркоту_сидит ебанул голубой гей хопа чмо лох петух за_наркоту_сидит лох погнал Слышь_ещё хоп
        понял чмо красный трансфестит за_наркоту_сидит залупа зелёный трансфестит за_наркоту_сидит залупа голубой трансфестит за_наркоту_сидит лох
        в_зону
            слышь погнал гобела погнал это_ты погнал харчок хоп
            стопэ хоп
        отсидел
        типа
        в_зону
            это_ты пиздец хоп
	    отсидел
    отсидел
отсидел